# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'awscli'
brew 'git'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'node'
brew 'trash'
brew 'wget'
brew 'mongodb'
brew 'r'
brew 'ruby'

# Development
brew 'php71'
brew 'php71-intl'
brew 'heroku'
cask 'tower'
cask 'webstorm'
cask 'cyberduck'
cask 'mamp'
cask 'postico'
cask 'robo-3t'

# Apps
cask 'firefox'
cask 'google-chrome'
cask 'imageoptim'
cask 'licecap'
cask 'spotify'
cask 'toggldesktop'
cask 'adobe-creative-cloud'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
mas '1Password', id: 443987910
mas 'Giphy Capture', id: 668208984
mas 'Sketch', id: 402476602
mas 'Magnet', id: 441258766
mas 'ScreencastMaker', id: 622339633
mas 'Slack', id: 803453959
mas 'Polymail', id: 1134717305
mas 'Medis', id: 1063631769
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Keynote', id: 409183694

